// laba_2sem_5.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//
#include<fstream>
#include <iostream>

int main()
{
    setlocale(LC_ALL, "ru");


    std::cout << "Hello World!\n";
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//  17. Дана матрица A из N строк и N столбцов. Если в матрице А элементы, равные нулю, встречаются
//не более, чем в двух строках, задать элементам X1, Х2, ..., ХN значения соответствующих по номеру
//элементов главной диагонали
